spot/doc/userdoc/tut22.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Creating an automaton by adding states and transitions</title>
<!-- 2018-01-20 Sat 14:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<meta  name="description" content="Code example for constructing ω-automata in Spot"
 />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="spot.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="tut.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Creating an automaton by adding states and transitions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#cpp">C++</a></li>
<li><a href="#sec-2">Python</a></li>
</ul>
</div>
</div>
<p>
This example demonstrates how to create an automaton and then print it.
</p>

<div id="outline-container-cpp" class="outline-2">
<h2 id="cpp"><a id="sec-1" name="sec-1"></a>C++</h2>
<div class="outline-text-2" id="text-cpp">

<div class="org-src-container">

<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;spot/twaalgos/hoa.hh&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;spot/twa/twagraph.hh&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>(<span class="org-type">void</span>)
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">The bdd_dict is used to maintain the correspondence between the</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">atomic propositions and the BDD variables that label the edges of</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">the automaton.</span>
  <span class="org-constant">spot</span>::<span class="org-type">bdd_dict_ptr</span> <span class="org-variable-name">dict</span> = <span class="org-constant">spot</span>::make_bdd_dict();
  <span class="org-comment-delimiter">// </span><span class="org-comment">This creates an empty automaton that we have yet to fill.</span>
  <span class="org-constant">spot</span>::<span class="org-type">twa_graph_ptr</span> <span class="org-variable-name">aut</span> = make_twa_graph(dict);

  <span class="org-comment-delimiter">// </span><span class="org-comment">Since a BDD is associated to every atomic proposition, the</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">register_ap() function returns a BDD variable number</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">that can be converted into a BDD using bdd_ithvar().</span>
  <span class="org-type">bdd</span> <span class="org-variable-name">p1</span> = bdd_ithvar(aut-&gt;register_ap(<span class="org-string">"p1"</span>));
  <span class="org-type">bdd</span> <span class="org-variable-name">p2</span> = bdd_ithvar(aut-&gt;register_ap(<span class="org-string">"p2"</span>));

  <span class="org-comment-delimiter">// </span><span class="org-comment">Set the acceptance condition of the automaton to Inf(0)&amp;Inf(1)</span>
  aut-&gt;set_generalized_buchi(2);

  <span class="org-comment-delimiter">// </span><span class="org-comment">States are numbered from 0.</span>
  aut-&gt;new_states(3);
  <span class="org-comment-delimiter">// </span><span class="org-comment">The default initial state is 0, but it is always better to</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">specify it explicitely.</span>
  aut-&gt;set_init_state(0U);

  <span class="org-comment-delimiter">// </span><span class="org-comment">new_edge() takes 3 mandatory parameters: source state,</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">destination state, and label.  A last optional parameter can be</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">used to specify membership to acceptance sets.</span>
  aut-&gt;new_edge(0, 1, p1);
  aut-&gt;new_edge(1, 1, p1 &amp; p2, {0});
  aut-&gt;new_edge(1, 2, p2, {1});
  aut-&gt;new_edge(2, 1, p1 | p2, {0, 1});

  <span class="org-comment-delimiter">// </span><span class="org-comment">Print the resulting automaton.</span>
  print_hoa(<span class="org-constant">std</span>::cout, aut);
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-hoa"><span class="org-hoa-header-uppercase">HOA:</span> v1
<span class="org-hoa-header-uppercase">States:</span> 3
<span class="org-hoa-header-uppercase">Start:</span> 0
<span class="org-hoa-header-uppercase">AP:</span> 2 <span class="org-string">"p1"</span> <span class="org-string">"p2"</span>
<span class="org-hoa-header-lowercase">acc-name:</span> generalized-Buchi 2
<span class="org-hoa-header-uppercase">Acceptance:</span> 2 <span class="org-hoa-builtin">Inf</span>(<span class="org-hoa-acceptance-set">0</span>)&amp;<span class="org-hoa-builtin">Inf</span>(<span class="org-hoa-acceptance-set">1</span>)
<span class="org-hoa-header-lowercase">properties:</span> trans-labels explicit-labels trans-acc
<span class="org-hoa-keyword">--BODY--</span>
<span class="org-hoa-header-uppercase">State:</span> 0
[<span class="org-hoa-ap-number">0</span>] 1
<span class="org-hoa-header-uppercase">State:</span> 1
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>] 1 {<span class="org-hoa-acceptance-set">0</span>}
[<span class="org-hoa-ap-number">1</span>] 2 {<span class="org-hoa-acceptance-set">1</span>}
<span class="org-hoa-header-uppercase">State:</span> 2
[<span class="org-hoa-ap-number">0</span> | <span class="org-hoa-ap-number">1</span>] 1 {<span class="org-hoa-acceptance-set">0 1</span>}
<span class="org-hoa-keyword">--END--</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Python</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-python"><span class="org-keyword">import</span> spot
<span class="org-keyword">import</span> buddy

<span class="org-comment-delimiter"># </span><span class="org-comment">The bdd_dict is used to maintain the correspondence between the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">atomic propositions and the BDD variables that label the edges of</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">the automaton.</span>
<span class="org-variable-name">bdict</span> = spot.make_bdd_dict();
<span class="org-comment-delimiter"># </span><span class="org-comment">This creates an empty automaton that we have yet to fill.</span>
<span class="org-variable-name">aut</span> = spot.make_twa_graph(bdict)

<span class="org-comment-delimiter"># </span><span class="org-comment">Since a BDD is associated to every atomic proposition, the register_ap()</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">function returns a BDD variable number that can be converted into a BDD using</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">bdd_ithvar() from the BuDDy library.</span>
<span class="org-variable-name">p1</span> = buddy.bdd_ithvar(aut.register_ap(<span class="org-string">"p1"</span>))
<span class="org-variable-name">p2</span> = buddy.bdd_ithvar(aut.register_ap(<span class="org-string">"p2"</span>))

<span class="org-comment-delimiter"># </span><span class="org-comment">Set the acceptance condition of the automaton to Inf(0)&amp;Inf(1)</span>
aut.set_generalized_buchi(2)

<span class="org-comment-delimiter"># </span><span class="org-comment">States are numbered from 0.</span>
aut.new_states(3)
<span class="org-comment-delimiter"># </span><span class="org-comment">The default initial state is 0, but it is always better to</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">specify it explicitely.</span>
aut.set_init_state(0)

<span class="org-comment-delimiter"># </span><span class="org-comment">new_edge() takes 3 mandatory parameters: source state, destination state, and</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">label.  A last optional parameter can be used to specify membership to</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">acceptance sets.  In the Python version, the list of acceptance sets the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">transition belongs to should be specified as a list.</span>
aut.new_edge(0, 1, p1)
aut.new_edge(1, 1, p1 &amp; p2, [0])
aut.new_edge(1, 2, p2, [1]);
aut.new_edge(2, 1, p1 | p2, [0, 1]);

<span class="org-comment-delimiter"># </span><span class="org-comment">Print the resulting automaton.</span>
<span class="org-keyword">print</span>(aut.to_str(<span class="org-string">'hoa'</span>))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-hoa"><span class="org-hoa-header-uppercase">HOA:</span> v1
<span class="org-hoa-header-uppercase">States:</span> 3
<span class="org-hoa-header-uppercase">Start:</span> 0
<span class="org-hoa-header-uppercase">AP:</span> 2 <span class="org-string">"p1"</span> <span class="org-string">"p2"</span>
<span class="org-hoa-header-lowercase">acc-name:</span> generalized-Buchi 2
<span class="org-hoa-header-uppercase">Acceptance:</span> 2 <span class="org-hoa-builtin">Inf</span>(<span class="org-hoa-acceptance-set">0</span>)&amp;<span class="org-hoa-builtin">Inf</span>(<span class="org-hoa-acceptance-set">1</span>)
<span class="org-hoa-header-lowercase">properties:</span> trans-labels explicit-labels trans-acc
<span class="org-hoa-keyword">--BODY--</span>
<span class="org-hoa-header-uppercase">State:</span> 0
[<span class="org-hoa-ap-number">0</span>] 1
<span class="org-hoa-header-uppercase">State:</span> 1
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>] 1 {<span class="org-hoa-acceptance-set">0</span>}
[<span class="org-hoa-ap-number">1</span>] 2 {<span class="org-hoa-acceptance-set">1</span>}
<span class="org-hoa-header-uppercase">State:</span> 2
[<span class="org-hoa-ap-number">0</span> | <span class="org-hoa-ap-number">1</span>] 1 {<span class="org-hoa-acceptance-set">0 1</span>}
<span class="org-hoa-keyword">--END--</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
